cf_billing/InformationRegisters/энргНастройкаРасчетаПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаРасчетаПени</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетПоТекущейСтавке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкаРасчетаПени/Forms/ФормаНастройкиРасчетаПени/Ext/Form/Module.bsl
#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьЗначениеНастройки();
	
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	СписокЭлементов = Новый Структура("Период, ТаблицаРасчётаПени");
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, СписокЭлементов, Метаданные.РегистрыСведений.энргНастройкаРасчетаПени);
	// -- Акимов Д.В.
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Модифицированность Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаОтветаПриЗакрытии", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область КомандыФормы
&НаКлиенте
Процедура ЗаписатьИЗакрытьРС(Команда)
	ЗаписатьРС(Команда);
	Если Не Модифицированность Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРС(Команда)
	
	ПредДо = Неопределено;
	Сч = 0;
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле ""Период"" не заполнено";
		Сообщение.Поле = "Период";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		
		Отказ = Истина;
	
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из ТаблицаРасчётаПени Цикл
		ТекстСообщения	= "";
		ПолеСообщения	= "";
		Если СтрокаТЗ.До = ПредДо Тогда
			ПолеСообщения = "До";
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Уже есть запись с таким ""До"".";
			Сообщение.Поле = "ТаблицаРасчётаГоспошлины[" + Сч + "]." + ПолеСообщения;
			Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			ВыдатьСообщение = Истина;
		КонецЕсли;
		
		ПредДо	= СтрокаТЗ.До;
		Сч		= Сч + 1;
	КонецЦикла;

	Если Не Отказ Тогда
		ЗаписатьНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СобытияЭлементовФормы
&НаКлиенте
Процедура ТаблицаРасчётаТаблицаРасчётаПениПриИзменении(Элемент)
	ОбновитьТаблицуРасчёта();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасчётаТаблицаРасчётаПениПослеУдаления(Элемент)
	ОбновитьТаблицуРасчёта();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасчётаТаблицаРасчётаПениПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Модифицированность = Истина;
	Период = НачалоМесяца(Период);
КонецПроцедуры
#КонецОбласти

#Область ВспомогательныеФункции
&НаКлиенте
Процедура ОбновитьТаблицуРасчёта()
	
	//Перем ПослДо, СтрокаТЗ, МаксЗнач;
	//
	//// Заполнение колонки "до"
	//МаксЗнач = 9999999999;
	//Для каждого СтрокаТЗ Из ТаблицаРасчётаПени Цикл
	//	Если СтрокаТЗ.До = 0 Тогда
	//		СтрокаТЗ.До = МаксЗнач;
	//	КонецЕсли;
	//КонецЦикла;	
	//
	//ТаблицаРасчётаПени.Сортировать("До Возр");
	//
	//// Заполнение колонки "от"
	//ПослДо = 0;
	//Для каждого СтрокаТЗ Из ТаблицаРасчётаПени Цикл
	//	СтрокаТЗ.От = ПослДо+1;  
	//	Если СтрокаТЗ.До < МаксЗнач Тогда
	//		ПослДо = СтрокаТЗ.До;
	//	Иначе 
	//		СтрокаТЗ.До = 0;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначениеНастройки()
	Перем ТЗ_Настройки;
	
	ЗаписьРС = РеквизитФормыВЗначение("Запись");
	
	Период		 = ЗаписьРС.Период;
	Организация	 = ЗаписьРС.Организация;
	ТЗ_Настройки = ЗаписьРС.НастройкаРасчета.Получить();

	Если ТЗ_Настройки <> Неопределено Тогда
		ЗначениеВРеквизитФормы(ТЗ_Настройки, "ТаблицаРасчётаПени");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	Перем ТЗ_Настройки;
	
	ЗаписьРС = РеквизитФормыВЗначение("Запись");
	ТЗ_Настройки = РеквизитФормыВЗначение("ТаблицаРасчётаПени");
	Хранилище = Новый ХранилищеЗначения(ТЗ_Настройки);
	
	ЗаписьРС.Период = Период;
	ЗаписьРС.Организация = Организация;
	ЗаписьРС.НастройкаРасчета = Хранилище;
	ЗаписьРС.Записать(Ложь);
	
	Модифицированность = Ложь; 
	
	ПолучитьЗначениеНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПриЗакрытии(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ЗаписатьИЗакрытьРС(Неопределено);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
